4ms/metamodule/firmware/lib/cmsis-device/stm32mp2xx/Source/Templates/gcc/startup_stm32mp213fxx_m33.s
/*******************************************************************************
 * Provide weak aliases for each Exception handler to the Default_Handler.
 * As they are weak aliases, any function with the same name will override
 * this definition.
 ******************************************************************************/
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers
 */
    .macro  def_irq_handler handler_name
    .weak \handler_name
    .thumb_set \handler_name, Default_Handler
    .endm

    def_irq_handler NMI_Handler
  def_irq_handler HardFault_Handler
  def_irq_handler MemManage_Handler
  def_irq_handler BusFault_Handler
  def_irq_handler UsageFault_Handler
  def_irq_handler SecureFault_Handler
  def_irq_handler SVC_Handler
  def_irq_handler DebugMon_Handler
  def_irq_handler PendSV_Handler
  def_irq_handler SysTick_Handler

  def_irq_handler PVD_IRQHandler
  def_irq_handler PVM_IRQHandler
  def_irq_handler IWDG3_IRQHandler
  def_irq_handler IWDG4_IRQHandler
  def_irq_handler IWDG1_RST_IRQHandler
  def_irq_handler IWDG2_RST_IRQHandler
  def_irq_handler IWDG4_RST_IRQHandler
  def_irq_handler WWDG1_IRQHandler
  def_irq_handler TAMP_IRQHandler
  def_irq_handler RTC_IRQHandler
  def_irq_handler TAMP_S_IRQHandler
  def_irq_handler RTC_S_IRQHandler
  def_irq_handler RCC_IRQHandler
  def_irq_handler EXTI2_0_IRQHandler
  def_irq_handler EXTI2_1_IRQHandler
  def_irq_handler EXTI2_2_IRQHandler
  def_irq_handler EXTI2_3_IRQHandler
  def_irq_handler EXTI2_4_IRQHandler
  def_irq_handler EXTI2_5_IRQHandler
  def_irq_handler EXTI2_6_IRQHandler
  def_irq_handler EXTI2_7_IRQHandler
  def_irq_handler EXTI2_8_IRQHandler
  def_irq_handler EXTI2_9_IRQHandler
  def_irq_handler EXTI2_10_IRQHandler
  def_irq_handler EXTI2_11_IRQHandler
  def_irq_handler EXTI2_12_IRQHandler
  def_irq_handler EXTI2_13_IRQHandler
  def_irq_handler EXTI2_14_IRQHandler
  def_irq_handler EXTI2_15_IRQHandler
  def_irq_handler HPDMA1_Channel0_IRQHandler
  def_irq_handler HPDMA1_Channel1_IRQHandler
  def_irq_handler HPDMA1_Channel2_IRQHandler
  def_irq_handler HPDMA1_Channel3_IRQHandler
  def_irq_handler HPDMA1_Channel4_IRQHandler
  def_irq_handler HPDMA1_Channel5_IRQHandler
  def_irq_handler HPDMA1_Channel6_IRQHandler
  def_irq_handler HPDMA1_Channel7_IRQHandler
  def_irq_handler HPDMA1_Channel8_IRQHandler
  def_irq_handler HPDMA1_Channel9_IRQHandler
  def_irq_handler HPDMA1_Channel10_IRQHandler
  def_irq_handler HPDMA1_Channel11_IRQHandler
  def_irq_handler HPDMA1_Channel12_IRQHandler
  def_irq_handler HPDMA1_Channel13_IRQHandler
  def_irq_handler HPDMA1_Channel14_IRQHandler
  def_irq_handler HPDMA1_Channel15_IRQHandler
  def_irq_handler HPDMA2_Channel0_IRQHandler
  def_irq_handler HPDMA2_Channel1_IRQHandler
  def_irq_handler HPDMA2_Channel2_IRQHandler
  def_irq_handler HPDMA2_Channel3_IRQHandler
  def_irq_handler HPDMA2_Channel4_IRQHandler
  def_irq_handler HPDMA2_Channel5_IRQHandler
  def_irq_handler HPDMA2_Channel6_IRQHandler
  def_irq_handler HPDMA2_Channel7_IRQHandler
  def_irq_handler HPDMA2_Channel8_IRQHandler
  def_irq_handler HPDMA2_Channel9_IRQHandler
  def_irq_handler HPDMA2_Channel10_IRQHandler
  def_irq_handler HPDMA2_Channel11_IRQHandler
  def_irq_handler HPDMA2_Channel12_IRQHandler
  def_irq_handler HPDMA2_Channel13_IRQHandler
  def_irq_handler HPDMA2_Channel14_IRQHandler
  def_irq_handler HPDMA2_Channel15_IRQHandler
  def_irq_handler HPDMA3_Channel0_IRQHandler
  def_irq_handler HPDMA3_Channel1_IRQHandler
  def_irq_handler HPDMA3_Channel2_IRQHandler
  def_irq_handler HPDMA3_Channel3_IRQHandler
  def_irq_handler HPDMA3_Channel4_IRQHandler
  def_irq_handler HPDMA3_Channel5_IRQHandler
  def_irq_handler HPDMA3_Channel6_IRQHandler
  def_irq_handler HPDMA3_Channel7_IRQHandler
  def_irq_handler HPDMA3_Channel8_IRQHandler
  def_irq_handler HPDMA3_Channel9_IRQHandler
  def_irq_handler HPDMA3_Channel10_IRQHandler
  def_irq_handler HPDMA3_Channel11_IRQHandler
  def_irq_handler HPDMA3_Channel12_IRQHandler
  def_irq_handler HPDMA3_Channel13_IRQHandler
  def_irq_handler HPDMA3_Channel14_IRQHandler
  def_irq_handler HPDMA3_Channel15_IRQHandler
  def_irq_handler ICACHE_IRQHandler
  def_irq_handler DCACHE_IRQHandler
  def_irq_handler ADC1_IRQHandler
  def_irq_handler ADC2_IRQHandler
  def_irq_handler FDCAN_CAL_IRQHandler
  def_irq_handler FDCAN1_IT0_IRQHandler
  def_irq_handler FDCAN2_IT0_IRQHandler
  def_irq_handler FDCAN1_IT1_IRQHandler
  def_irq_handler FDCAN2_IT1_IRQHandler
  def_irq_handler TIM1_BRK_IRQHandler
  def_irq_handler TIM1_UP_IRQHandler
  def_irq_handler TIM1_TRG_COM_IRQHandler
  def_irq_handler TIM1_CC_IRQHandler
  def_irq_handler TIM2_IRQHandler
  def_irq_handler TIM3_IRQHandler
  def_irq_handler TIM4_IRQHandler
  def_irq_handler I2C1_IRQHandler
  def_irq_handler I3C1_IRQHandler
  def_irq_handler I2C2_IRQHandler
  def_irq_handler I3C2_IRQHandler
  def_irq_handler SPI1_IRQHandler
  def_irq_handler SPI2_IRQHandler
  def_irq_handler USART1_IRQHandler
  def_irq_handler USART2_IRQHandler
  def_irq_handler USART3_IRQHandler
  def_irq_handler TIM8_BRK_IRQHandler
  def_irq_handler TIM8_UP_IRQHandler
  def_irq_handler TIM8_TRG_COM_IRQHandler
  def_irq_handler TIM8_CC_IRQHandler
  def_irq_handler FMC_IRQHandler
  def_irq_handler SDMMC1_IRQHandler
  def_irq_handler TIM5_IRQHandler
  def_irq_handler SPI3_IRQHandler
  def_irq_handler UART4_IRQHandler
  def_irq_handler UART5_IRQHandler
  def_irq_handler TIM6_IRQHandler
  def_irq_handler TIM7_IRQHandler
  def_irq_handler ETH1_SBD_IRQHandler
  def_irq_handler ETH1_PMT_IRQHandler
  def_irq_handler ETH1_LPI_IRQHandler
  def_irq_handler ETH2_SBD_IRQHandler
  def_irq_handler ETH2_PMT_IRQHandler
  def_irq_handler ETH2_LPI_IRQHandler
  def_irq_handler USART6_IRQHandler
  def_irq_handler I2C3_IRQHandler
  def_irq_handler I3C3_IRQHandler
  def_irq_handler USBH_EHCI_IRQHandler
  def_irq_handler USBH_OHCI_IRQHandler
  def_irq_handler DCMI_PSSI_IRQHandler
  def_irq_handler CSI2HOST_IRQHandler
  def_irq_handler CRYP1_IRQHandler
  def_irq_handler HASH1_IRQHandler
  def_irq_handler PKA_IRQHandler
  def_irq_handler FPU_IRQHandler
  def_irq_handler UART7_IRQHandler
  def_irq_handler LPUART1_IRQHandler
  def_irq_handler SPI4_IRQHandler
  def_irq_handler SPI5_IRQHandler
  def_irq_handler SPI6_IRQHandler
  def_irq_handler SAI1_IRQHandler
  def_irq_handler LTDC_IRQHandler
  def_irq_handler LTDC_ER_IRQHandler
  def_irq_handler LTDC_SEC_IRQHandler
  def_irq_handler LTDC_SEC_ER_IRQHandler
  def_irq_handler SAI2_IRQHandler
  def_irq_handler OCTOSPI1_IRQHandler
  def_irq_handler OTFDEC1_IRQHandler
  def_irq_handler LPTIM1_IRQHandler
  def_irq_handler USBH_WAKEUP_IRQHandler
  def_irq_handler SPDIFRX_IRQHandler
  def_irq_handler IPCC1_RX_IRQHandler
  def_irq_handler IPCC1_TX_IRQHandler
  def_irq_handler IPCC1_RX_S_IRQHandler
  def_irq_handler IPCC1_TX_S_IRQHandler
  def_irq_handler SAES_IRQHandler
  def_irq_handler CRYP2_IRQHandler
  def_irq_handler OTG_WAKEUP_IRQHandler
  def_irq_handler MDF1_FLT0_IRQHandler
  def_irq_handler MDF1_FLT1_IRQHandler
  def_irq_handler MDF1_FLT2_IRQHandler
  def_irq_handler MDF1_FLT3_IRQHandler
  def_irq_handler SAI3_IRQHandler
  def_irq_handler TIM15_IRQHandler
  def_irq_handler TIM16_IRQHandler
  def_irq_handler TIM17_IRQHandler
  def_irq_handler TIM12_IRQHandler
  def_irq_handler SDMMC2_IRQHandler
  def_irq_handler DCMIPP_IRQHandler
  def_irq_handler nCTIIRQ1_IRQHandler
  def_irq_handler nCTIIRQ2_IRQHandler
  def_irq_handler TIM13_IRQHandler
  def_irq_handler TIM14_IRQHandler
  def_irq_handler TIM10_IRQHandler
  def_irq_handler RNG1_IRQHandler
  def_irq_handler HASH2_IRQHandler
  def_irq_handler SDMMC3_IRQHandler
  def_irq_handler LPTIM2_IRQHandler
  def_irq_handler LPTIM3_IRQHandler
  def_irq_handler LPTIM4_IRQHandler
  def_irq_handler LPTIM5_IRQHandler
  def_irq_handler CPU1_SEV_IRQHandler
  def_irq_handler RCC_WAKEUP_IRQHandler
  def_irq_handler SAI4_IRQHandler
  def_irq_handler DTS_IRQHandler
  def_irq_handler TIM11_IRQHandler
  def_irq_handler CPU2_WAKEUP_PIN_IRQHandler
  def_irq_handler OTG_IRQHandler
  def_irq_handler RNG2_IRQHandler
  def_irq_handler SERF_IRQHandler
  def_irq_handler RAMCFG_IRQHandler
  def_irq_handler DDRCTRL_IRQHandler
  def_irq_handler DDRPHYC_IRQHandler
  def_irq_handler DFI_ERR_IRQHandler
  def_irq_handler IAC_IRQHandler
  def_irq_handler VDDCPU_VD_IRQHandler
  def_irq_handler VDDCORE_VD_IRQHandler
  def_irq_handler HPDMA1Handler
  def_irq_handler HPDMA2Handler
  def_irq_handler HPDMA3Handler
  def_irq_handler DBG_AUTH_HOST_IRQHandler
  def_irq_handler DBG_AUTH_ACK_IRQHandler
  def_irq_handler RCC_HSI_FMON_IRQHandler
  def_irq_handler RCC_MSI_FMON_IRQHandler
  def_irq_handler EXTI1_0_IRQHandler
  def_irq_handler EXTI1_1_IRQHandler
  def_irq_handler EXTI1_2_IRQHandler
  def_irq_handler EXTI1_3_IRQHandler
  def_irq_handler EXTI1_4_IRQHandler
  def_irq_handler EXTI1_5_IRQHandler
  def_irq_handler EXTI1_6_IRQHandler
  def_irq_handler EXTI1_7_IRQHandler
  def_irq_handler EXTI1_8_IRQHandler
  def_irq_handler EXTI1_9_IRQHandler
  def_irq_handler EXTI1_10_IRQHandler
  def_irq_handler EXTI1_11_IRQHandler
  def_irq_handler EXTI1_12_IRQHandler
  def_irq_handler EXTI1_13_IRQHandler
  def_irq_handler EXTI1_14_IRQHandler
  def_irq_handler EXTI1_15_IRQHandler
  def_irq_handler DDRPERFM_IRQHandler
